Revit 2026 API

# ExternalServiceId Class

---

Unique identifier of an external service.

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DB.ExternalServiceExternalServiceId

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalServiceId : GuidEnum
```
```vb
Public Class ExternalServiceId
	Inherits GuidEnum
```
```cpp
public ref class ExternalServiceId : public GuidEnum
```
```fsharp
type ExternalServiceId =
    class
        inherit GuidEnum
    end
```

The ExternalServiceId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalServiceId | Creates a new ExternalServiceId instance. |

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum) |
|  | GetHashCode | Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(ExternalServiceId, ExternalServiceId) | Compares two ExternalServiceId instances. |
|  | Inequality(ExternalServiceId, ExternalServiceId) | Compares two ExternalServiceId instances. |

Each external service must have a unique ExternalServiceId. The Id can be registered with Revit for servers to easily find it. Unique ExternalServiceId should be created using GUID generation tool. ExternalServiceId can later be used to access registered external services.

#### Reference

Autodesk.Revit.DB.ExternalService Namespace